[
    {
        "title": "SQL Injection in Login Form",
        "description": "A critical SQL injection vulnerability was discovered in the application's login form. The username field is vulnerable to SQL injection attacks, allowing attackers to bypass authentication and potentially extract sensitive data from the database. The vulnerability is caused by improper input validation and direct concatenation of user input into SQL queries.",
        "writeup_links": [],
        "cves": [
            "CVE-2023-12345"
        ],
        "metadata": {},
        "timestamp": "2024-05-08T19:55:00Z"
    },
    {
        "title": "Hack The Box — Jerry Write-up",
        "description": "Hack The Box — Jerry Write-up",
        "writeup_links": [
            "https://medium.com/ctf-writeups/hack-the-box-jerry-write-up-6f045601315f"
        ],
        "cves": [],
        "metadata": {},
        "timestamp": "2025-05-08T23:03:21.698Z"
    },
    {
        "title": "Training Data from URL: https://medium.com/ctf-writeups/hack-the-box-jerry-write-up-6f045601315f",
        "description": "The write-up details the exploitation of the 'Jerry' box on Hack The Box, which runs on Windows with the IP 10.10.10.95 and Apache Tomcat on port 8080. The initial step involved using default credentials ('tomcat' and 's3cret') to access the Manager App, which allows for the upload of a WAR file. An authenticated RCE was achieved using the Metasploit module `multi/http/tomcat_mgr_upload`, leading to immediate system access. The author found both flags needed for submission in a directory on the Administrator's desktop. The overall difficulty of the box is rated as \"Piece of cake,\" making it an accessible challenge for beginners.",
        "writeup_links": [
            "https://medium.com/ctf-writeups/hack-the-box-jerry-write-up-6f045601315f"
        ],
        "cves": [],
        "metadata": {
            "source": "URL Summarization"
        },
        "timestamp": "2025-05-10T13:43:40.415417"
    },
    {
        "title": "Cross-Site Scripting (XSS) in Search Bar",
        "description": "A reflected XSS vulnerability was identified in the search bar of the application. By injecting malicious JavaScript code into the search query, attackers can execute scripts in the context of other users' browsers. This vulnerability arises due to improper sanitization of user input.",
        "writeup_links": [
            "https://example.com/xss-vulnerability-details"
        ],
        "cves": [
            "CVE-2024-56789"
        ],
        "metadata": {},
        "timestamp": "2025-05-11T10:00:00Z"
    },
    {
        "title": "Buffer Overflow in File Upload Module",
        "description": "A buffer overflow vulnerability was discovered in the file upload module. Attackers can exploit this by uploading a specially crafted file, leading to arbitrary code execution on the server. The issue is caused by insufficient bounds checking on the file input.",
        "writeup_links": [
            "https://example.com/buffer-overflow-details"
        ],
        "cves": [
            "CVE-2025-12345"
        ],
        "metadata": {},
        "timestamp": "2025-05-11T10:30:00Z"
    }
]